import React, { useState } from "react";

import icon from "../../../../assets/img/temp/home_icon.png";

import css from "./Description.module.scss";

const Description = (props) => {
  const array = ["", "", "", "", "", "", "", ""];
  const tabs = ["Опис", "Оновлення", "Платежі"];

  const [activeTab, setActiveTab] = useState(0);

  const handleClick = (id) => {
    setActiveTab(id);
  };

  const Description = (props) => {
    return (
      <div className={css.column_description}>
        <h3>Опис</h3>
        <p>
          Для кожної дитини лікування раку це важке випробування. Наші маленькі
          супергерої стійко витримують фізичний біль під час лікування.Але окрім
          чисто фізичного болю з дітьми відбуваються візуальними зміни. В
          наслідок хіміотерапії діти втрачають волосся і з'являється
          психологічний дискомфорт: зміна звичного образу, незручність вийти "на
          люди" без волосся й "виглядати як інопланетянин". Перука в такому
          випадку стає не лише візуальним захистом, а ще й додає впевненості і
          можливості бути "таким як всі", що є дуже важливим особливо для
          підлітків.
        </p>
        <p>
          В середньому, щоб виготовити одну перуку, потрібно обстригти волосся
          чотирьом людям. Його довжина має бути мінімум 35 см, воно має бути
          доглянутим: може бути фарбоване, але не пошкоджене. Вартість
          виготовлення перуки коливається від 8 до 15 тис. гривень. Нам вдалося
          знайти майстрів, які дізнавшись про акцію, погодилися виготовити їх за
          6 тис.грн. Онкохворим діткам зазвичай підходять перуки лише з
          натурального волосся, оскільки на синтетичні матеріали у них може бути
          алергія. У нас є майстри, які сплетуть перуки, тому крок за кроком ми
          зможемо потішити наших маленьких героїв й зробити процес лікування
          комфортнішим й трішки легшим для них.
        </p>

        <h3>Як долучитися до акції:</h3>
        <ul>
          <li>
            Обстригти своє волосся і пожертвувати його на перуку для онкохворих
            діток. Адреса для пересилки Нова Пошта м. Львів, відділення 5, ,БФ
            "КРИЛА НАДІЇ", 0503709002
          </li>
          <li>
            Обстригти своє волосся і пожертвувати його на перуку для онкохворих
            діток. Адреса для пересилки Нова Пошта м. Львів, відділення 5, ,БФ
            "КРИЛА НАДІЇ", 0503709002
          </li>
          <li>
            Обстригти своє волосся і пожертвувати його на перуку для онкохворих
            діток. Адреса для пересилки Нова Пошта м. Львів, відділення 5, ,БФ
            "КРИЛА НАДІЇ", 0503709002
          </li>
        </ul>
        <img src={icon} alt="" />
        <h3>Список необхідних медикаментів</h3>
        <ul>
          <li>
            Довжина волосся, яка найбільше підходить під виготовлення перуки від
            35 см
          </li>
          <li>
            Довжина волосся, яка найбільше підходить під виготовлення перуки від
            35 см
          </li>
          <li>
            Довжина волосся, яка найбільше підходить під виготовлення перуки від
            35 см
          </li>
          <li>
            Довжина волосся, яка найбільше підходить під виготовлення перуки від
            35 см
          </li>
        </ul>
      </div>
    );
  };
  const Update = (props) => {
    return (
      <>
        <div className={css.column_update}>
          {array.map((t, idx) => (
            <div key={idx} className={css.update}>
              <div className={css.date}>
                <span className={css.n}>22</span>
                <span className={css.mounth}> Жовтень 1997</span>
              </div>
              <h4 className={css.title}>Назва нового оновлення</h4>
              <p className={css.subtitle}>
                Для кожної дитини лікування раку це важке випробування. Наші
                маленькі супергерої стійко витримують фізичний біль під час
                лікування.Але окрім чисто фізичного болю з дітьми відбуваються
                візуальними зміни. В наслідок хіміотерапії діти втрачають
                волосся і з'являється психологічний дискомфорт: зміна звичного
                образу, незручність вийти "на люди" без волосся й "виглядати як
                інопланетянин". Перука в такому випадку стає не лише візуальним
                захистом, а ще й додає впевненості і можливості бути "таким як
                всі", що є дуже важливим особливо для підлітків
              </p>
            </div>
          ))}
        </div>
      </>
    );
  };
  const Payments = (props) => {
    return (
      <div className={css.column_payments}>
        {array.map((t, idx) => (
          <div key={idx} className={css.payment}>
            <div className={css.ico}>
              <img src={icon} alt="" />
            </div>
            <div className={css.info}>
              <p className={css.date}> 22 Жовтень 2022</p>
              <h4 className={css.name}>Анонімно</h4>
              <div className={css.money}>250 грн</div>
              <p className={css.subtitle}>
                Кирил чекає на день, коли лікарі дозволять йому знову ганяти на
                самокаті.
              </p>
            </div>
          </div>
        ))}
      </div>
    );
  };
  return (
    <section className={css.project_description}>
      <div className={css.tabs}>
        <div className={css.tabs}>
          {tabs.map((t, idx) => (
            <button
              key={idx}
              id={idx}
              onClick={(e) => handleClick(idx)}
              className={`${css.tab} ${activeTab === idx ? css.active : ""}`}
            >
              {t}
            </button>
          ))}
        </div>
      </div>

      <div className={css.column}>
        {activeTab == 0 && Description()}
        {activeTab == 1 && Update()}
        {activeTab == 2 && Payments()}
      </div>
    </section>
  );
};

export default Description;
